&НаКлиенте
Процедура Запуск(Команда)
	
  ИмяОтчета = Строка(ВариантыЗагрузок);
	
  Разрешение = ОбщийМодульСервер.РазрешитьФормированиеОтчета(ИмяОтчета, 1200);
	
  Если Разрешение[ИмяОтчета] = Ложь Тогда 
	
    ЗагрузитьВариантНаСервере(ИмяОтчета,НомерМашины);
	
	ПодключитьОбработчикОжидания("Обработчик", 8,Истина);
	
	ПоказатьОповещениеПользователя("Запуск подгрузки отчёта "+ИмяОтчета);
	
	Элементы.ФормаЗапуск.Доступность = Ложь;
	
  Иначе сообщить("Отчёт "+ИмяОтчета+" уже подгружается");	
     
  КонецЕсли;  
  
  
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗагрузитьВариантНаСервере(Отчёт,Номер)
	
	Текст = Новый ТекстовыйДокумент();
	
	Текст.ДобавитьСтроку("Car="+Номер);
	
	Текст.Записать("\\Lena\Common\Тойкер\Установка цен ВЕСТИМЕНТА\CarNumber.txt", КодировкаТекста.OEM);
			
	ЗапуститьПриложение("C:\WWW\Авто загрузки\"+Отчёт+".bat", "C:\WWW\Авто загрузки");
					
КонецПроцедуры	

&НаКлиенте
Процедура Обработчик()
	
  Элементы.ФормаЗапуск.Доступность = Истина;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВариантыЗагрузокПриИзменении(Элемент)
	
	Элементы.НомерМашины.Видимость = Ложь;
	
	ИмяОтчета = Строка(ВариантыЗагрузок);
	
	Если ИмяОтчета = "МашиныВестименты" тогда
		
		Элементы.НомерМашины.Видимость = Истина;
		
	КонецЕсли;	

КонецПроцедуры
