
#Область СобытияФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонстантыМассив = Новый Массив;
	КонстантыМассив.Добавить("СмсРассылка");
//	КонстантыМассив.Добавить("ХранилищеЗаявокУТ11");
	
	Для Каждого Константа Из КонстантыМассив Цикл
		//
		ХранилищеЗначения = Константы[Константа].Получить();
		ТЗ = ХранилищеЗначения.Получить();
		
		Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
			ЭтотОбъект["Адрес" + Константа] = ПоместитьВоВременноеХранилище(ТЗ, УникальныйИдентификатор);
		Иначе
			Элементы["ОткрытьДанные" + Константа].Доступность = Ложь;
			Элементы["Записать" + Константа].Доступность = Ложь;
		КонецЕсли;
		//
	КонецЦикла;
	
	
	
КонецПроцедуры



#КонецОбласти



#Область Редактирование


&НаКлиенте
Процедура ОткрытьДанные(Команда)
	
	ТекущаяСтраницаИмя = Элементы.Разделы.ТекущаяСтраница.Имя;
	ПараметрыФормыРедактирования = Новый Структура("АдресТаблицыВХ", ЭтаФорма["Адрес" + ТекущаяСтраницаИмя]);
	ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииРедактирования", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.Расш1_РедактированиеТаблицВХ", ПараметрыФормыРедактирования,,,,, ОповещениеПриЗакрытии); 	
		
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытииРедактирования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	 Модифицированность = Истина;
	 ТекущаяСтраницаИмя = Элементы.Разделы.ТекущаяСтраница.Имя;
	 Элементы["Записать" + ТекущаяСтраницаИмя].Доступность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Записать(Команда)
	ТекущаяСтраницаИмя = Элементы.Разделы.ТекущаяСтраница.Имя;
	ЗаписатьДанныеВКонстантуНаСервере(ЭтаФорма["Адрес" + ТекущаяСтраницаИмя], ТекущаяСтраницаИмя);
	//
	Модифицированность = Ложь;
	Элементы["Записать" + ТекущаяСтраницаИмя].Доступность = Ложь;
	//
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьДанныеВКонстантуНаСервере(Адрес, ИмяКонстанты)
	
	ХранилищеЗначения = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
	Константы[ИмяКонстанты].Установить(ХранилищеЗначения);

КонецПроцедуры




#КонецОбласти




