//////////////////////////////////////ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;	
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////









&НаСервереБезКонтекста
Процедура СписокВыборНаСервере(Договор)
	
	//Ставим признак "По умолчанию"
	Если НЕ Договор.ПоУмолчанию Тогда
		
		Отбор = Новый Структура("Организация", Договор.Организация);
		ДоговораПоУмолчанию = Справочники.ДоговорыКонтрагентов.Выбрать(, Договор.Владелец, Отбор);
		
		Пока ДоговораПоУмолчанию.Следующий() Цикл
			//
			Если ДоговораПоУмолчанию.ПоУмолчанию Тогда
				Попытка
					ДоговорОбъект = ДоговораПоУмолчанию.ПолучитьОбъект();
					ДоговорОбъект.ПоУмолчанию = НЕ ДоговорОбъект.ПоУмолчанию;
					ДоговорОбъект.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;	
			//	
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		ДоговорОбъект = Договор.ПолучитьОбъект();
		ДоговорОбъект.ПоУмолчанию = НЕ ДоговорОбъект.ПоУмолчанию;
		ДоговорОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПоУмолчанию" Тогда
		СтандартнаяОбработка = Ложь;
		СписокВыборНаСервере(ВыбраннаяСтрока);
		Элемент.Обновить();
	КонецЕсли;	
	
КонецПроцедуры


