
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Обнуление доступного остатка
	Движения.ТаможняОплатаГТД.Записывать = Истина;
	Движение = Движения.ТаможняОплатаГТД.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.ГТД = ГТД;
	Движение.ПодИнвойсНомер = ПодИнвойсНомер;
	Движение.Сумма = Остаток;
	Движение.ТипДвижения = "Корректировка остатка по машине";
	
	// регистр ТаможняОплатаГТД Приход
	Движение = Движения.ТаможняОплатаГТД.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ГТД = ГТД;
	Движение.ПодИнвойсНомер = ПодИнвойсНомер;
	Движение.Сумма = СуммаКорректировки;
	Движение.ТипДвижения = "Корректировка остатка по машине";
	
КонецПроцедуры
