////Дима 07.10.2014 15:40:57////Функция врзвращает Истина, если значение поля есть в отборе справочника "Инициаторы"
Функция ОтборПоИнициатору(Инициатор, ЗначениеПоля) Экспорт
	
	ТЧ_Инициаторы = Инициатор.Инициаторы;
	
	Отбор = ТЧ_Инициаторы.Найти(ЗначениеПоля, "Инициатор");
	
	Если  Отбор = Неопределено Тогда
		возврат Ложь;
	Иначе
		возврат Истина;
	КонецЕсли;	
	
КонецФункции  


Функция ОтборПоСтатье(Инициатор, ЗначениеПоля) Экспорт
	
	ТЧ_Статьи = Инициатор.Статьи;
	
	Отбор = ТЧ_Статьи.Найти(ЗначениеПоля, "СтатьяРасхода");
	
	Если  Отбор = Неопределено Тогда
		возврат Ложь;
	Иначе
		возврат Истина;
	КонецЕсли;	
	
КонецФункции
//конец Дима

