//////////////////////////////////////ПРОЦЕДУРЫ И ФУНКЦИИ СОБЫТИЙ ФОРМЫ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкаПолейОтправки = РегистрыСведений.НастройкаПолейОтправки.СоздатьНаборЗаписей();
	НастройкаПолейОтправки.Отбор.Организация.Установить(ТекущийОбъект.Организация);
	НастройкаПолейОтправки.Отбор.ТипДвижения.Установить(ТекущийОбъект.ТипДвижения);
	НастройкаПолейОтправки.Отбор.Получатель.Установить(ТекущийОбъект.Получатель);
	//
	НастройкаПолейОтправки.Прочитать();
	Если НастройкаПолейОтправки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте настройки регистра сведений ""Настройка полей отправки!!!""",, "Запись.Организация");
		Отказ = Истина;
	КонецЕсли;	
	
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ////Блокируем изменение даты прихода, если есть документ - основание
    //Если ТипЗнч(Запись.НомерПлатежа) = Тип("ДокументСсылка.ТаможняРассчёты") Тогда
    //    Элементы.ДатаПоступления.Доступность = Ложь;
    //КонецЕсли;    
    //
    
КонецПроцедуры
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////





