
&НаКлиенте
Процедура Расш1_ГТДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Владелец", "КорректировкаОплатГТД");
	ПараметрыОткрытияФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыОткрытияФормы.Вставить("ДатаСреза", КонецДня(Объект.Дата));
	ПараметрыОткрытияФормы.Вставить("ДатаДокумента" , Объект.Дата);
	
	ОткрытьФорму("Документ.ТаможняРассчёты.Форма.ФормаВыбораГТД", ПараметрыОткрытияФормы, ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	УстановитьВыполнениеОбработчиковСобытия(Ложь);
	
		
	
КонецПроцедуры
