
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		 	
	ПодключитьОбработчикОжидания("Обработчик", 60);
	
	Разрешение = ОбщийМодульСервер.РазрешитьФормированиеОтчета("Счёт91", 1200);
	Элементы.ФормаЗагрузкаБухгалтерия.Доступность = НЕ Разрешение.Счёт91;
	Элементы.ФормаСформировать.Доступность = НЕ Разрешение.Счёт91;
	ПериодЗагрузки = Разрешение.МоментЗагрузки;
	
	КонецПроцедуры

&НаКлиенте
Процедура Обработчик()
	
  Разрешение = ОбщийМодульСервер.РазрешитьФормированиеОтчета("Счёт91", 1200);
	
    Если (ТекущаяДата()- МоментЗагрузки) > 60 Тогда
	  Элементы.ФормаЗагрузкаБухгалтерия.Доступность = НЕ Разрешение.Счёт91;
	  Элементы.ФормаСформировать.Доступность = НЕ Разрешение.Счёт91;
   КонецЕсли;
  
  ПериодЗагрузки = Разрешение.МоментЗагрузки;	
  	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузкаБухгалтерия(Команда)
	
	ЗагрузитьВариантНаСервере();
	Элементы.ФормаЗагрузкаБухгалтерия.Доступность = Ложь;
	Элементы.ФормаСформировать.Доступность = Ложь;
	МоментЗагрузки = ТекущаяДата();
   	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьВариантНаСервере()
	
	ЗапуститьПриложение("C:\WWW\Авто загрузки\Счёт91.bat", "C:\WWW\Авто загрузки");
		
КонецПроцедуры	


