
&НаКлиенте
Процедура ДоговорыКонтрагентовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ДоговорПоОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = ПолучитьПараметрыВыбора(Объект.Организация, Объект.Контрагент);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыбора(Организация, Контрагент)

	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Справочники.Организации.НайтиПоРеквизиту("ИНН", Контрагент.ИНН));
	Отбор.Вставить("Владелец", Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Организация.ИНН));
	
	ПараметрыОткрытия = Новый Структура("Отбор", Отбор);
	
	Возврат ПараметрыОткрытия;
	

КонецФункции




