
//////////////////////////////////////ПРОЦЕДУРЫ ОБРАБОТКИ СОБЫТИЙ ФОРМЫ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьРаспределениеПоПокупателям = ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоПокупателям");
	
	
	////Дима 21.10.2015 10:44:39////Установим параметр динамического списка "Оплата машин"
	ОплатаМашин.Параметры.УстановитьЗначениеПараметра("Машина", Объект.Ссылка);
	//конец Дима
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ПодИнвойсы.Количество() > 0 Тогда
		Если Объект.ВалютнаяСтоимость <> Объект.ПодИнвойсы.Итог("Сумма") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверное распределение по подинвойсам!!!",, "Объект.ПодИнвойсы");
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////







//////////////////////////////////////ПРОЦЕДУРЫ ОБРАБОТКИ ОСНОВНОЙ ВКЛАДКИ///////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	Объект.Наценка = 0;
КонецПроцедуры


&НаКлиенте
Процедура КурсГТДПриИзменении(Элемент)
	ОбновлениеСуммы();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеСуммы()

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РассчитатьИтоговуюСумму();
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ВалютнаяСтоимостьПриИзменении(Элемент)
	ОбновлениеСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТаможенныйПлатёжПриИзменении(Элемент)
	ОбновлениеСуммы()
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
	ОбновлениеСуммы()
КонецПроцедуры


////Дима 29.07.2014 10:13:31////Открыть справочника с оборотами по контрагентам
&НаКлиенте
Процедура ПокупательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДляТаможни");
	Форма.Список.Параметры.УстановитьЗначениеПараметра("НачалоМесяца", НачалоМесяца(Объект.Дата));
	Форма.Список.Параметры.УстановитьЗначениеПараметра("Граница", ПолучитьГраницуПериода());
	Выбор = Форма.ОткрытьМодально();
	
	Объект.Покупатель = ?(Выбор = Неопределено, Объект.Покупатель, Выбор);  
	
КонецПроцедуры
//Конец Дима

&НаСервере
Функция ПолучитьГраницуПериода()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Граница = Документ.ПолучитьГраницуПериода();
	возврат Граница;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	//ОрганизацияПриИзмененииНаСервере();
	
	//
	УстановитьВидимостьОбъектов();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ОпределениеКонтрагентовИНаценки();
	ЗначениеВРеквизитФормы(Документ, "Объект");	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ПоставщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоставщикПриИзмененииНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьДоговорПоУмолчанию();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	
КонецПроцедуры


//
&НаКлиенте
Процедура УстановитьВидимостьОбъектов()
	
	Видимость = Истина;
		
	//	
	Если Объект.РаспределениеПоПокупателям.Количество() > 0 Тогда
		Элементы.Группа7.Видимость = Истина;
		Видимость = Ложь;
	Иначе
		Элементы.Группа7.Видимость = ИспользоватьРаспределениеПоПокупателям;
	КонецЕсли;	
	//	

	
	//
	Элементы.Покупатель.Видимость = Видимость;
	Элементы.Наценка.Видимость = Видимость;
	Элементы.КонтрагентЗвена.Видимость = Видимость;
	Элементы.СуммаДолга.Видимость = Видимость;
	//
		
	
КонецПроцедуры
//



////Дима 20.10.2016 12:33:53////Изменение номера машины
&НаКлиенте
Процедура ИзменитьНомер(Команда)
	
 	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Нельзя менять номер прихода, созданного на основании заявки!!!");
		Возврат;
	КонецЕсли;
	
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ИзменениеНомераМашины", ЭтаФорма);
	ПоказатьВводСтроки(ОбработкаЗакрытия,, "Введите номер машины...");	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНомераМашины(Строка, ДополнительныеПараметы) Экспорт 
	
	Попытка
		Объект.НомерМашины = Число(Строка);
	Исключение
		Сообщить("Введён неккоректный номер!!!");
	КонецПопытки;	
	
КонецПроцедуры	
//конец Дима



/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////






//////////////////////////////////////ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ  ЧАСТИ РАСПРЕДЕЛЕНИЕ ПО ПОКУПАТЕЛЯМ//////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура РаспределениеПоПокупателямПриИзменении(Элемент)
	УстановитьВидимостьОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоПокупателямПокупательПриИзменении(Элемент)
	
	Элементы.РаспределениеПоПокупателям.ТекущиеДанные.ТорговляНаименование = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаМашин1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элементы.ОплатаМашин1.ТекущиеДанные.ПлатежныйДокумент);
	
	
КонецПроцедуры



/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





//////////////////////////////////////ОБРАБОЧИКИ ТАБЛИЧНОЙ ЧАСТИ РАСПРЕДЕЛЕНИЕ ПО ПОДИНВОЙСАМ//////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура РаспределитьПодПодинвойсамНажатие(Элемент)
	Элементы.ПодИнвойсы.Видимость = НЕ Элементы.ПодИнвойсы.Видимость;
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





