
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Список = Новый СписокЗначений;
	//Список.Добавить("Основной");
	//Список.Добавить("Глоссаб");
	//Список.Добавить("Сравнение дат");
			
	//Список.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите окно отчета", Список[0]);
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ВывестиФорму", ЭтотОбъект);
	Отбор = Новый Структура("ИмяОтчета", "ДДС");
	ПараметрыВыбора = Новый Структура("Отбор, РежимВыбора", Отбор, Истина);
	
	ОткрытьФорму("Справочник.ВариантыОтчетов.ФормаСписка", ПараметрыВыбора,,,,, ОписаниеОповещенияОВыборе);
		
КонецПроцедуры


&НаКлиенте
Процедура ВывестиФорму(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		КлючВарианта = ВыбранныйЭлемент.КлючВарианта;
		ПФормы = Новый Структура("КлючВарианта, КлючПользовательскихНастроек", КлючВарианта, ПолучитьКлючТекущихНастроек(КлючВарианта));
		ОткрытьФорму("Отчет.ДДС.Форма.ФормаОтчета", ПФормы, , ВыбранныйЭлемент.Наименование, ВариантОткрытияОкна.ОтдельноеОкно);
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Функция ПолучитьКлючТекущихНастроек(КлючВарианта)
	Возврат ХранилищеСистемныхНастроек.Загрузить("Отчет.ДДС/" + КлючВарианта + "/КлючТекущихПользовательскихНастроек");
КонецФункции	