
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкомпоноватьРезультат();
    	
	ПодключитьОбработчикОжидания("Обработчик", 60);
	
	Разрешение = ОбщийМодульСервер.РазрешитьФормированиеОтчета("ДолжникиБухгалтерии", 1200);
	Элементы.ФормаРассылкаДолжники.Доступность = НЕ Разрешение.ДолжникиБухгалтерии;
	Элементы.ФормаСформировать.Доступность = НЕ Разрешение.ДолжникиБухгалтерии;
	
	КонецПроцедуры

&НаКлиенте
Процедура Обработчик()
	
  Разрешение = ОбщийМодульСервер.РазрешитьФормированиеОтчета("ДолжникиБухгалтерии", 1200);
	
    Если (ТекущаяДата()- МоментРассылкаДолжники) > 60 Тогда
	  Элементы.ФормаРассылкаДолжники.Доступность = НЕ Разрешение.ДолжникиБухгалтерии;
	  Элементы.ФормаСформировать.Доступность = НЕ Разрешение.ДолжникиБухгалтерии;
    КонецЕсли;  
	
  	
КонецПроцедуры	

&НаКлиенте
Процедура РассылкаДолжники(Команда)
	
	ЗагрузитьВариантНаСервере();
	Элементы.ФормаРассылкаДолжники.Доступность = Ложь;
	Элементы.ФормаСформировать.Доступность = Ложь;
	МоментРассылкаДолжники = ТекущаяДата();
   	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьВариантНаСервере()
	
	ЗапуститьПриложение("C:\WWW\Авто загрузки\Подгрузка должников бухгалтерии.bat", "C:\WWW\Авто загрузки");
		
КонецПроцедуры	


