
&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	
	ДиалогОткрытияФайла.Заголовок = "Выберите сценарий для загрузки...";
	ДиалогОткрытияФайла.Каталог = Запись.Путь;
	ДиалогОткрытияФайла.Фильтр = "Сценарии для загрузки(*.bat)|*.bat";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Запись.Путь = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
		ОбщаяДлина = СтрДлина(ДиалогОткрытияФайла.ПолноеИмяФайла);
		ДлинаПути = СтрДлина(ДиалогОткрытияФайла.Каталог);
		
		ИмяФайла = Прав(ДиалогОткрытияФайла.ПолноеИмяФайла, ОбщаяДлина - ДлинаПути);
		Запись.Сценарий = СтрЗаменить(ИмяФайла, ".bat", "");
		
	Иначе
		Предупреждение("Ничего не выбрано!!!");
		
	КонецЕсли;	
	
	
КонецПроцедуры
