#Область СобытияФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Таблица внешнего реестра
	Если Параметры.Свойство("АдресРеестраПлатежей") Тогда
		Отчет.АдресРеестраПлатежей = Параметры.АдресРеестраПлатежей;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	АдресФайла = "\\main-sql02.ukritter.local\Документация\Дмитрий\Отчёты 1С\Фабрика\Бюджетирование\БюджетированиеПланФакт.erf";	
	
	Оповещение = Новый ОписаниеОповещения("Оповещение", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,, АдресФайла, Ложь);

	
КонецПроцедуры




#КонецОбласти


#Область ПодменаОтчёта

&НаКлиенте
Процедура Оповещение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Парам = Новый Структура("АдресРеестраПлатежей", Отчет.АдресРеестраПлатежей);
	
	ИмяОтчёта = ПодключитьВнешнийОтчёт(Адрес);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОтчёта + ".Форма.ОсновнаяФормаОтчёта", Парам);
	
КонецПроцедуры

&НаСервере
Функция ПодключитьВнешнийОтчёт(АдресХранилища)
	Возврат ВнешниеОтчеты.Подключить(АдресХранилища,, Ложь);
КонецФункции 

#КонецОбласти
