
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ID = ПолучитьIDНовойЗаписи();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПослеЗаписиНаСервере(ID)
	ВнешниеИсточникиДанных.SqlЗатратыНовый.ПересчитатьИндекс("spOrg", ID);
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере(Объект.ID);
КонецПроцедуры


#КонецОбласти





#Область ВспомогательныеПроцедурыИФункции


&НаСервереБезКонтекста
Функция ПолучитьIDНовойЗаписи()

  Запрос = Новый Запрос;
  Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                 |	сп_Организация.ID КАК ID
                 |ИЗ
                 |	ВнешнийИсточникДанных.Бюджетирование.Таблица.сп_Организация КАК сп_Организация
                 |
                 |УПОРЯДОЧИТЬ ПО
                 |	ID УБЫВ";
  
  
  Результат = Запрос.Выполнить();
  
  Возврат ?(НЕ Результат.Пустой(), Результат.Выгрузить()[0].ID + 1, 1);
  
КонецФункции


#КонецОбласти