Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Контрагент.ВалютныйРассчёт Тогда	
		Представление = "Оплата зарубеж " + Данные.Номер;
		СтандартнаяОбработка = Ложь;
	Иначе
		Представление = "Платежное поручение " + Данные.Номер;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Контрагент");
	Поля.Добавить("Номер");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
