
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Получатель) Тогда
		ТекущийОбъект.Получатель = Неопределено;
		
	ИначеЕсли ТекущийОбъект.ТипДвижения = Перечисления.ТипДвиженияДДС.ОстатокНаНачало Тогда
		
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Тип движения " + Запись.ТипДвижения + " не распределяется по получателям!!!");
		Отказ = Истина;
		
	ИначеЕсли ТекущийОбъект.ТипДвижения = Перечисления.ТипДвиженияДДС.Поступление И НЕ ВалютныйРасчёт(ТекущийОбъект.Получатель) Тогда 	
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Тип движения " + Запись.ТипДвижения + " не распределяется по контрагентам!!!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВалютныйРасчёт(Получатель)
	
	Если ТипЗнч(Получатель) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Получатель.ВалютныйРассчёт;
	
КонецФункции	
