// Выполняет начальную инициализацию подсистемы прав для работы с внешними источниками данных.
Процедура НачальнаяИнициализация() Экспорт
    
    Профиль = Справочники.ПрофилиГруппДоступа.ПользовательВнешнихИсточниковДанных.ПолучитьОбъект();
    
    Роли = Новый Массив;
    Роли.Добавить("БазовыеПрава");
    Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
    Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
    Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
    Роли.Добавить("ЗапускВебКлиента");
    Роли.Добавить("ЗапускТонкогоКлиента");
    Роли.Добавить("ЗапускТолстогоКлиента");
    Роли.Добавить("ИзменениеТекущегоПользователя");
    Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
    Роли.Добавить("ЧтениеБазовойНСИ");
    Роли.Добавить("ЧтениеДополнительныхСведений");
    Роли.Добавить("ПользовательВнешнихИсточниковДанных");
    
    РольДобавлена = Ложь;
    Для Каждого Роль Из Роли Цикл
        Если Профиль.Роли.Найти(Роль) = Неопределено Тогда
            Профиль.Роли.Добавить().Роль = Роль;
            РольДобавлена = Истина;
        КонецЕсли;
    КонецЦикла;
    
    Если РольДобавлена Тогда
        Профиль.Записать();
    КонецЕсли;
    
    ГруппаДоступа = Справочники.ГруппыДоступа.ПользователиВнешнихИсточниковДанных.ПолучитьОбъект();
    Если ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
        ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.ПользовательВнешнихИсточниковДанных;
        ГруппаДоступа.Записать();
    КонецЕсли;
    
    ГруппаДоступа = Справочники.ГруппыДоступа.Администраторы.ПолучитьОбъект();
    Если ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
        ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.Администратор;
        ГруппаДоступа.Записать();
    КонецЕсли;
    
КонецПроцедуры
