#Область ОбрабочикиТаблицыЗначений


//Получение сложного отбора из таблицы значений
//Параметры:
//ТЗ - таблица значений
//Колонка - имя колонки для установки отбора
//ВидСравнения - вид сравнения (системное перечисление)
//Значение - значение отбора
&Вместо("ПолучитьСложныйОтборТЗ")
Функция Расш1_ПолучитьСложныйОтборТЗ(Таблица,        
	                           Колонка = Неопределено,
							   Отбор = Неопределено,
							   ВидСортировки = Неопределено,
							   знач Значение = Неопределено)     Экспорт

							   
  Построитель = Новый ПостроительЗапроса;
  Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);
 
  Если ВидСравнения <> Неопределено Тогда
	  //  
	  Если ТипЗнч(Отбор) <> Тип("Массив") Тогда   
		  тОтбор = Построитель.Отбор.Добавить(Колонка);
		  тОтбор.ВидСравнения = Отбор;
		  тОтбор.Значение = Значение;
		  тОтбор.Использование = Истина;
	  Иначе
		  Для Каждого ЭлементОтбора Из Отбор Цикл
			  тОтбор = Построитель.Отбор.Добавить(ЭлементОтбора.Колонка);
			  тОтбор.ВидСравнения = ЭлементОтбора.ВидСравнения;
			  тОтбор.Значение = ЭлементОтбора.Значение;
			  тОтбор.Использование = Истина;
		  КонецЦикла;	  
		  //
	  КонецЕсли;	  
  КонецЕсли;

	  
  Если ВидСортировки <> Неопределено Тогда
	  Построитель.Порядок.Добавить(Колонка,,, ВидСортировки);
  КонецЕсли;	  
	  
  Построитель.Выполнить();
  Возврат Построитель.Результат.Выгрузить();
 
  КонецФункции



#КонецОбласти