//////////////////////////////////////ОБРАБОТКА СОБЫТИЙ ФОРМ//////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Владелец.ВалютныйРассчёт Тогда
		Элементы.БИК.Заголовок = "Swift";
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	БанковскиеСчета.Ссылка <> &ТекущийОбъект
	               |	И БанковскиеСчета.НомерСчета = &НомерСчета
	               |	И БанковскиеСчета.Владелец = &Владелец
	               |	И БанковскиеСчета.Валюта = &Валюта";
				   
	Запрос.УстановитьПараметр("НомерСчета", ТекущийОбъект.НомерСчета);			   
	Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Владелец);			   
	Запрос.УстановитьПараметр("Валюта", ТекущийОбъект.Валюта);
	Запрос.УстановитьПараметр("ТекущийОбъект", ТекущийОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счёт с такими реквизитами уже существует!!!", Выборка.Ссылка);
	КонецЦикла;	
	
	
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////







&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	БИКПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура БИКПриИзмененииНаСервере()
	
	Банк = Справочники.КлассификаторБанковРФ.НайтиПоКоду(Объект.БИК);
	
	Объект.КоррСчет = Банк.КоррСчет;
	Объект.Банк = Банк;
	Объект.Наименование = Банк.Наименование;
	
КонецПроцедуры



