
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
					
	// СКД.
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, 
	                                              Настройки, 
												  ДанныеРасшифровки);
												  
												  
    РеестрИзБазы = Настройки.ПараметрыДанных.Элементы.Найти("РеестрИзБазы");
	Если РеестрИзБазы.Использование И 
		                            НЕ ПустаяСтрока(ЭтотОбъект.АдресРеестраПлатежей) Тогда
	  Реестр = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресРеестраПлатежей);
    Иначе
	  Реестр = Новый ТаблицаЗначений;
	КонецЕсли;  
	
	
	ВнешнийНаборДанных = Новый Структура("Реестр", Реестр);								  
											 
			  
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки, Истина);
	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	
	
КонецПроцедуры

