//////////////////////////////////////ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ ДДС//////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////



////Дима 27.10.2015 17:32:16////Запись валютного рассчёта в подсистему ДДС
Процедура ЗаписьВалютногоРассчётаВДДСПриПроведении(Источник, Отказ) Экспорт
	
	Если НЕ Источник.Контрагент.ВалютныйРассчёт И НЕ Источник.Организация.ВалютныйРассчёт  Тогда
		возврат;
	КонецЕсли;	
	
	ЗаписатьВРегистрДДС(Отказ, Источник);
	

КонецПроцедуры
//конец Дима


////Дима 28.10.2015 12:36:54////Удаление валютного рассчёта из подсистемы ДДС
Процедура УдалениеВалютногоРассчётаИзДДСПередУдалением(Источник, Отказ) Экспорт
	
	Если НЕ Источник.Контрагент.ВалютныйРассчёт Тогда
		возврат;
	КонецЕсли;	
	
	ЗаписатьВРегистрДДС(Отказ, Источник, Истина);
	
	
КонецПроцедуры
//конец Дима


//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>



////Дима 08.06.2016 12:01:14////Заполнить запись регистра из источника
Процедура ЗаписатьВРегистрДДС(Отказ, Источник, Удаление = Ложь)
	
	ДДС = РегистрыСведений.ДДС.СоздатьНаборЗаписей();
	ТаблицаЗаписи = ДДС.ВыгрузитьКолонки();
	ТаблицаЗаписи.Колонки.Добавить("ПутьКРеквизиту", Новый ОписаниеТипов("Строка", ,
													 Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная))); 
	
	НоваяЗапись = ТаблицаЗаписи.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник);
	
	НоваяЗапись.Период = НачалоДня(Источник.Дата);
	НоваяЗапись.Получатель = Источник.Контрагент;
	НоваяЗапись.НомерПлатежа = Источник.Ссылка;
	НоваяЗапись.НомерВБухгалтерии = ПолучитьНомерВБухгалтерии(ДДС, Источник);
	НоваяЗапись.ТипДвижения = Перечисления.ТипДвиженияДДС.Списание;
	НоваяЗапись.ПутьКРеквизиту = "Объект.Контрагент";
	
	
	НоваяЗапись.ДеньВДень = ?(НоваяЗапись.СчетОрганизации.Бик = НоваяЗапись.СчетКонтрагента.Бик, Истина, Ложь);
	
	
	Попытка
		НоваяЗапись.ДатаПоступления = Источник.ДополнительныеСвойства.ДатаПрихода;
	Исключение
	КонецПопытки;
		
	Для Счетчик = 0 По Источник.Боркин.Количество() - 1 Цикл
		
		ЗаписьТЗ = ТаблицаЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьТЗ, НоваяЗапись,, "СчетКонтрагента, ДоговорыКонтрагентов");
		
		строка = Источник.Боркин[Счетчик];
		ЗаписьТЗ.Организация = Строка.Организация;
		ЗаписьТЗ.СчетОрганизации = Строка.СчетОрганизации;
		ЗаписьТЗ.Получатель = Строка.Контрагент;
		ЗаписьТЗ.Период = Строка.ДатаПрихода;
		ЗаписьТЗ.Сумма = Строка.Сумма;
		ЗаписьТЗ.ТипДвижения = Перечисления.ТипДвиженияДДС.Поступление;
		ЗаписьТЗ.ДеньВДень = ?(ЗаписьТЗ.СчетОрганизации.Бик = НоваяЗапись.СчетКонтрагента.Бик, Истина, Ложь);
		ЗаписьТЗ.ПутьКРеквизиту = "Объект.Боркин[" + строка(Счетчик) + "].Контрагент";
		
	КонецЦикла;	
	
	Если Удаление Тогда
		ТаблицаЗаписи.ЗаполнитьЗначения(0, "Сумма");
	КонецЕсли;	
	
	
	//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
		
	
	//Запишем данные в базу с помощью обработки
	ОбработкаДДС = Обработки.ЗаполнениеРегистраДДС.Создать();
			
	ПоляУдаления = Новый Массив;
	ПоляУдаления.Добавить("НомерПлатежа");
	
	
	
	//
	Отказ = НЕ ОбработкаДДС.ПроверитьНаСоответствиеРегиструНастройкаПолей(ТаблицаЗаписи);
	
	Если НЕ Отказ Тогда
		
		Попытка
			ОбработкаДДС.ЗаполнитьНаборДвижений(ТаблицаЗаписи, ПоляУдаления, Новый УникальныйИдентификатор);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	

	
КонецПроцедуры
//конец Дима



////Дима 01.08.2017 16:49:08////
//Проверяет возможность оплаты поставщику со счёта организации (актально для Глоссаб)
Функция ПроверитьСчётНаПолучателя(Счёт, КодСтраныПолучателя) Экспорт

	ЗапрещённыеСтраны = РегистрыСведений.ЗапрещённыеСтраны.СоздатьНаборЗаписей();
	ЗапрещённыеСтраны.Отбор.Банк.Установить(Счёт.Бик);
	ЗапрещённыеСтраны.Прочитать();
	
	Если ЗапрещённыеСтраны.Количество() > 0 Тогда
		Для Каждого Запись Из ЗапрещённыеСтраны Цикл
			Если Запись.ЗапрещённаяСтрана.Код = КодСтраныПолучателя Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции
//конец Дима


Функция ПолучитьНомерВБухгалтерии(ДДС, Источник)

	ДДС.Отбор.НомерПлатежа.Установить(Источник.Ссылка);
	ДДС.Прочитать();
	
	Если ДДС.Количество() > 0 Тогда
		Возврат ДДС[0].НомерВБухгалтерии;
	КонецЕсли;	

КонецФункции // ПолучитьНомерПлатежа()
