//////////////////////////////////////ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ/////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	  ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
	//Установим валюту таможенных платежей
	Валюта = Справочники.Валюты.НайтиПоКоду("840");
	Документ = РеквизитФормыВЗначение("Объект");
	
	Если Документ.ЭтоНовый() Тогда
		Объект.Валюта = Валюта;
    КонецЕсли;
	//
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Вставим ответственного пользователя
	УстановитьПривилегированныйРежим(Истина);
	  ТекущийОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	УстановитьПривилегированныйРежим(Ложь);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	////Дима 28.07.2014 16:41:36////Отменил проведение во время записи
	//Документ при записи всегда будет проводиться
	//ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	//ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	////Дима 9/24/2014 11:25:42 AM////Проверка даты запрета редактирования
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект)
	//Конец Дима	
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////




//////////////////////////////////////ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ//////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура НомерМашиныПриИзменении(Элемент)
	Объект.ВалютнаяСтоимость = Неопределено;
	Объект.НомерГТД = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ВалютнаяСтоимость = Неопределено;
	Объект.НомерГТД = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ТаможенныйПлатёжПриИзменении(Элемент)
	
  Объект.Валюта = Валюта;
  Объект.ВалютнаяСтоимость = 0;
  Объект.СуммаТамПлат = 0;
	
КонецПроцедуры



&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Отбор = Новый Структура("Родитель, ПометкаУдаления, Закрыта", ПредопределенноеЗначение("Справочник.Организации.Таможни"), Ложь, Ложь);
	ПараметрыОткрытияФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Организации.ФормаВыбора", ПараметрыОткрытияФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Отбор = Новый Структура("Родитель, ПометкаУдаления, Закрыта", ПредопределенноеЗначение("Справочник.Организации.Таможни"), Ложь, Ложь);
	ПараметрыПолученияДанных.Вставить("Отбор", Отбор);
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////


&НаСервере
Функция ПолучениеЗначенияДополнительнойХарактеристики()

	Значение = Справочники.ПользовательскиеХарактеристики.НайтиПоНаименованию("Таможня");
	
	возврат Значение;
	
КонецФункции 








