//////////////////////////////////////ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("ВалютныйРассчёт", Объект.Владелец));	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;	
	
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Валюта");	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Организация");	
	
	
	Если (Валюта <> Объект.Валюта
		Или Организация <> Объект.Организация) Тогда
		
		ЕстьДокументы = КритерииОтбора.ДоговорыКонтрагентов.Найти(Объект.Ссылка);
		Если ЕстьДокументы.Количество() > 0 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение справочника участвует в документах!!!", , "Объект.Валюта");
		КонецЕсли;  
		
	КонецЕсли;		
	
	
	
КонецПроцедуры
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////





