///////////////////////////////////////////////////////////////////////////////////
// Подсистема "Пользователи в модели сервиса".
// 
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Открывает форму ввода пароля пользователя сервиса
//
// Параметры:
//  ВладелецФормы             - УправляемаяФорма, которую нужно оповестить о выборе.
//  ПарольПользователяСервиса - Строка - пароль пользователя сервиса
//  ПарольЕщеНеВведен         - Булево
//
Процедура ЗапроситьПарольДляАутентификацииВСервисе(ВладелецФормы, ПарольПользователяСервиса, ПарольЕщеНеВведен) Экспорт
	
	Если ПарольПользователяСервиса <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.АутентификацияВСервисе", , ВладелецФормы);
	
	ПарольЕщеНеВведен = Истина;
	
КонецПроцедуры
