&Вместо("ОбновлениеСправочникаОрганизаций")
////Дима 12.02.2020 11:47:07////ОбновлениеСправочникаОрганизаций (убрал использование базы Упп)
Процедура Основное_ОбновлениеСправочникаОрганизаций() Экспорт
	
	//Получим подключения к базам
	СтрутураПодключений = Новый Структура;
	АдресСтруктурыПодключений = ПоместитьВоВременноеХранилище(СтрутураПодключений);
	ПодключениеКВнешнимИБ.ПроверкаПодключения(Перечисления.ТипОрганизации.Розница, АдресСтруктурыПодключений);
	ПодключениеКВнешнимИБ.ПроверкаПодключения(Перечисления.ТипОрганизации.РозницаУсн, АдресСтруктурыПодключений);
	ПодключениеКВнешнимИБ.ПроверкаПодключения(Перечисления.ТипОрганизации.Опт, АдресСтруктурыПодключений);
	ПодключениеКВнешнимИБ.ПроверкаПодключения(Перечисления.ТипОрганизации.Управление, АдресСтруктурыПодключений);
	ПодключениеКВнешнимИБ.ПроверкаПодключения(Перечисления.ТипОрганизации.Звено, АдресСтруктурыПодключений);
	
	
	//Запуск обработки обновления справочника организаций	
	Обработка = Обработки.ЗагрузкаСправочникаОрганизаций.Создать();
	Обработка.ПолучениеСпискаКЗагрузке(АдресСтруктурыПодключений);
	
КонецПроцедуры
//конец Дима
