////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Определяет разделы, в которых доступна команда вызова дополнительных обработок
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных)
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять 
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола()
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	////Дима 23.09.2014 11:25:39////Добавил подсистемы для внешних обработок
	  Разделы.Добавить(Метаданные.Подсистемы.НастройкаИАдминистрирование);
	  Разделы.Добавить(Метаданные.Подсистемы.ДенежныеСредства);
	////Конец Дима
	
		
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных)
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять 
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола()
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	////Дима 20.10.2014 16:30:03////Добавил подсистемы для внешних отчётов
	Разделы.Добавить(Метаданные.Подсистемы.Таможня);
	//конец Дима	
	
КонецПроцедуры

