
Функция ЗагрузитьЗаявкиЗагрузить(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	//
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());          	
	
	Попытка
		МассивЗаписи = ПрочитатьJSON(ЧтениеJson,, "ОплатитьДо", ФорматДатыJSON.ISO);
	Исключение
		Ответ.КодСостояния = 500;
		Ответ.УстановитьТелоИзСтроки("Передан не тот формат данных!!!!!" + Символы.ПС + ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	//	
	Если ТипЗнч(МассивЗаписи) <> Тип("Массив") Тогда
		Ответ.КодСостояния = 500;
		Ответ.УстановитьТелоИзСтроки("Передан не тот формат данных!!!!!" + Символы.ПС + ТипЗнч(МассивЗаписи));
		Возврат Ответ;
	КонецЕсли;
	
	//
	ТаблицаЗначенийЗагрузки = ПолучитьТаблицуЗначенийЗагрузки(МассивЗаписи); 
	Константы.ХранилищеЗаявокУТ11.Установить(Новый ХранилищеЗначения(ТаблицаЗначенийЗагрузки, Новый СжатиеДанных(9)));
	Возврат Ответ;
	
	
КонецФункции



Функция ПолучитьТаблицуЗначенийЗагрузки(Массив)
	
	ТЗ = Новый ТаблицаЗначений;	
	
	Если Массив.Количество() > 0 Тогда
		
		//Заполним колонки
		ОбразецКолонок = Массив[0];
		Для Каждого Колонка Из ОбразецКолонок Цикл
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(Колонка.Значение));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			ТЗ.Колонки.Добавить(Колонка.Ключ, ОписаниеТипов);
		КонецЦикла;
		//
		
		//Заполним строки
		Для Каждого Строка Из Массив Цикл
			ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Строка);
		КонецЦикла;
		//
		
		
	КонецЕсли;
	
	
	Возврат ТЗ;
	
	
	
КонецФункции
