
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Расшифровка) Тогда
		
		Организации = Новый СписокЗначений;
		ПолучитьСписокОрганизаций(Параметры.Расшифровка.РасшифровкаМассив, Организации, Параметры.Расшифровка.ДанныеРасшифровки, Параметры.ДобавитьОрганизации);
		
		Отбор = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = ?(НЕ Параметры.ДобавитьОрганизации, "Организация", "Организация.ИНН");
		
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Отбор.ПравоеЗначение = Организации;	  
		
		Параметры.Отбор.Вставить("ТипДвижения", Перечисления.ТипДвиженияДДС.Списание);
		
		Если Параметры.ДобавитьОрганизации Тогда
			ГруппировкаСписка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ГруппировкаСписка.Поле = Новый ПолеКомпоновкиДанных("Организация");
			Элементы.Список.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
		КонецЕсли;
		
	КонецЕсли;	
	
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



#Область ОбработкаСписка
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Расшифровка) Тогда
		
		Если НЕ Параметры.ДобавитьОрганизации Тогда
			ОповеститьОВыборе(Элемент.ТекущиеДанные.Получатель);	
		Иначе
			СтандартнаяОбработка = ЛОЖЬ;
			ОповеститьОВыборе(ВыбраннаяСтрока.Ключ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отбор = Новый Структура("Организация, ТипДвижения, Получатель",
	                         Элемент.ТекущиеДанные.Организация,
							 Элемент.ТекущиеДанные.ТипДвижения,
							 Элемент.ТекущиеДанные.Получатель);
	
	СписокПередУдалениемНаСервере(Отказ, Отбор);
	
	Если Отказ Тогда
		ОткрытьФорму("РегистрСведений.ДДС.ФормаСписка", Новый Структура("Отбор, КлючПользовательскихНастроек", Отбор, "Пустые"));
		ВызватьИсключение("Есть движения ДДС!!!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПередУдалениемНаСервере(Отказ, Отбор)
	
	ДДС = РегистрыСведений.ДДС.СоздатьНаборЗаписей();
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		ДДС.Отбор[ЭлементОтбора.Ключ].Установить(ЭлементОтбора.Значение);
	КонецЦикла;
	
	ДДС.Прочитать();
	
	Если ДДС.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти



&НаСервереБезКонтекста
Процедура ПолучитьСписокОрганизаций(МассивРасшифровок, Организации, ДанныеРасшифровки, ДобавитьОрганизации = ЛОЖЬ)
	
	Для Каждого Расшифровка из МассивРасшифровок Цикл
		
		СтруктураРасшифровки = ОбщийМодульСервер.ПолучениеРасшифровкиВСтруктуру(Расшифровка, ДанныеРасшифровки, Новый Структура);
		
		Попытка
			Если НЕ ДобавитьОрганизации Тогда
				Организации.Добавить(СтруктураРасшифровки.Организация);
			Иначе
				Организации.Добавить(СтруктураРасшифровки.Получатель.ИНН);   				
			КонецЕсли; 
		Исключение
		КонецПопытки;
		                     		
	КонецЦикла;  
		
КонецПроцедуры








