////Дима 14.07.2014 16:55:43////Загрузим из торговли данные по машинам
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Поместим во временное хранилище структуру подключений
	ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
			
	Попытка
		ФормаРодитель = ЭтаФорма.ВладелецФормы.Родитель;
	Исключение
		ФормаРодитель = ЭтаФорма;
	КонецПопытки;
	
	Если ФормаРодитель.АдресСтруктурыПодключений = "" Тогда 
		СтруктураПодключений = Новый Структура;
		ФормаРодитель.АдресСтруктурыПодключений = ПоместитьВоВременноеХранилище(СтруктураПодключений,ФормаРодитель.УникальныйИдентификатор);
	КонецЕсли;
	
	//Проверим подключения к внешним ИБ
	Отказ = Ложь;
	ПроверкаПодключения(ФормаРодитель.АдресСтруктурыПодключений,Отказ);
	
	ОчиститьСообщения();
	Если Отказ Тогда
		Сообщить("Подключение к торговле не выполнено.");
		возврат;
	Иначе
		Сообщить("Подключение к торговле выполнено.");
	КонецЕсли;
	
	//Загрузим данные
	МассивОтказов = Новый Массив;
	ТаможняСервер.ЗагрузкаДанных(ФормаРодитель.АдресСтруктурыПодключений, ПараметрКоманды);
	Сообщить("Данные обновлены.");
	
		
	//ОбновимОтображение
	Попытка
		ЭтаФорма.Элементы.Список.Обновить();
	Исключение
		ЭтаФорма.Прочитать();
	КонецПопытки;	
	
КонецПроцедуры


&НаСервере
Процедура ПроверкаПодключения(АдресСтруктурыПодключений,Отказ)
	
	ПодключениеКВнешнимИБ.ПроверкаПодключения(Перечисления.ТипОрганизации.Торговля,АдресСтруктурыПодключений,Отказ);  	
	
КонецПроцедуры

