//////////////////////////////////////ФОНОВЫЕ ЗАДАНИЯ//////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////


////Дима 27.05.2015 11:10:37////Фоновое подключение внешних ИБ
Процедура ПодключениеВнешнихИБ(АдресСтруктурыПодключений, СписокБаз, Задержка = 5) Экспорт
	
	ПодключенныеБазы = 0;
	ПроцентЗагрузки = 0;
	
	СтруктураПодключенийФоновая = Новый Структура;
	
	Для Каждого база из СписокБаз Цикл
		
		Если Не база.Пометка Тогда
			продолжить;
		КонецЕсли;	
		
		
		Отказ = Ложь;
		ПодключениеКВнешнимИБ.ПроверкаПодключения(база.Значение, АдресСтруктурыПодключений, Отказ, СтруктураПодключенийФоновая);
		
		Если НЕ Отказ Тогда
			ПодключенныеБазы = ПодключенныеБазы + 1;
			ПроцентЗагрузки = Окр(ПодключенныеБазы / СписокБаз.Количество() * 100, 0);
			ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, Строка(База.Значение) + " подключено!!!	" + Строка(ПроцентЗагрузки));
		Иначе
			ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, Строка(База.Значение) + " не подключено!!!	" + Строка(ПроцентЗагрузки));
		КонецЕсли;	
			
		
	КонецЦикла;	
	
	ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Завершено!!!!!	100");	
	
	ДатаОкончания = ТекущаяДата() + Задержка;
	Пока ТекущаяДата() < ДатаОкончания Цикл
	КонецЦикла;	
	
	
	ПоместитьВоВременноеХранилище(СтруктураПодключенийФоновая, АдресСтруктурыПодключений);
	

	
КонецПроцедуры
//конец Дима

///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////




////Дима 13.02.2020 11:06:36////Универсальная процедура запуска фоновых заданий в различных местах
//////////////////////////////////////////////////////////////////////////////////////////////////
//  ПараметрыВыполнения      - Структура - все необходимые параметры для 
//                           выполнения вызываемой процедуры
//                           в стуктуре должен быть ключ ПутьДлительнойПроцедуры - путь к  экспортной процедуре общего модуля 
//                                                                                                       или менеджера объекта
//  АдресХранилища         - Адрес во временном хранилище - туда помещается результат выполнения

Процедура УнверсальнаяОберткаФоновыхЗаданий(ПараметрыВыполнения, АдресХранилища) Экспорт
	Выполнить(ПараметрыВыполнения.ПутьДлительнойПроцедуры + "(ПараметрыВыполнения, АдресХранилища)");
КонецПроцедуры


