
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ТаможняВзаимозадолженности
	Движения.ТаможняВзаимозадолженности.Записывать = Истина;
	Движение = Движения.ТаможняВзаимозадолженности.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ДатаОстатка;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.СуммаДолга = СуммаОстатка;
	Движение.ВалютнаяСуммаДолга = ВалютнаяСуммаОстатка;
	Движение.ТипДвижения = "Ввод начальных остатков";
	
КонецПроцедуры
