
&НаКлиенте
Процедура Расш1_ПоказатьЗадолженности(Команда)
	
  ИмяОтчета = ПодключитьОтчетНаСервере("Отчет по взаимозадолженностям");
  
  Отбор = Новый Структура;
  Отбор.Вставить("Организация", Объект.Организация);
  Отбор.Вставить("Контрагент", Объект.Контрагент);  
  
  ПараметрыОткрытияФормы = Новый Структура("Отбор", Отбор);
  
  
  ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".Форма", ПараметрыОткрытияФормы, Элементы.ДоговорыКонтрагентов,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры


&НаСервере
Функция ПодключитьОтчетНаСервере(НаименованиеОбработки)
	
	//
	Ссылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки);
	ИмяОтчета = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Ссылка);
	//
	
	возврат ИмяОтчета;	
	
КонецФункции
//конец Дима



