////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры
//

// Получить параметры соединения в виде структуры.
// 
// Параметры: 
// Нет
// 
// Возвращаемое значение: 
// Структура. 
// Содержит параметры соединения.
// 
&НаКлиенте
Функция ПолучитьПараметрыСоединения() Экспорт
    Результат = Новый Структура;
    Результат.Вставить("АутентификацияСтандартная", АутентификацияСтандартная);
    Результат.Вставить("АутентификацияСтандартнаяВключена", АутентификацияСтандартнаяВключена);
    Результат.Вставить("ИмяПользователя", ИмяПользователя);
    Результат.Вставить("ИмяПользователяВключено", ИмяПользователяВключено);
    Результат.Вставить("Пароль", Пароль);
    Результат.Вставить("ПарольУстановлен", ПарольУстановлен);
    Результат.Вставить("СтрокаСоединения", СтрокаСоединения);
    Результат.Вставить("СтрокаСоединенияВключена", СтрокаСоединенияВключена);
    Результат.Вставить("ПарольИзменен", ПарольИзменен);
    Результат.Вставить("СУБД", СУБД);
    Результат.Вставить("СУБДВключена", СУБДВключена);
    Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы
//

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
    ПарольИзменен = Истина;
    ПарольУстановлен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольУстановленПриИзменении(Элемент)
    ПарольИзменен = Истина;
    Пароль = "";
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияСтандартнаяПриИзменении(Элемент)
    АутентификацияСтандартнаяВключена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяПриИзменении(Элемент)
    ИмяПользователяВключено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтрокаСоединенияПриИзменении(Элемент)
    СтрокаСоединенияВключена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СУБДПриИзменении(Элемент)
    СУБДВключена = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отмена, СтандартнаяОбработка)
    ПредставлениеИсточникаДанных = Параметры.ПредставлениеИсточникаДанных;
    Если Параметры.ПользовательИБ = "" Тогда
        Элементы.РедактируемыйПользователь.Видимость = Ложь;
    Иначе
        РедактируемыйПользователь = Параметры.ПользовательИБ;
    КонецЕсли;
    АутентификацияСтандартная = Параметры.Параметры.АутентификацияСтандартная;
    АутентификацияСтандартнаяВключена = Параметры.Параметры.АутентификацияСтандартнаяВключена;
    ИмяПользователя = Параметры.Параметры.ИмяПользователя;
    ИмяПользователяВключено = Параметры.Параметры.ИмяПользователяВключено;
    Если Параметры.Параметры.ПарольУстановлен = Истина Тогда
        Пароль = "------";
    КонецЕсли;
    ПарольУстановлен = Параметры.Параметры.ПарольУстановлен;
    СтрокаСоединения = Параметры.Параметры.СтрокаСоединения;
    СтрокаСоединенияВключена = Параметры.Параметры.СтрокаСоединенияВключена;
    СУБД = Параметры.Параметры.СУБД;
    СУБДВключена = Параметры.Параметры.СУБДВключена;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд формы
//

&НаКлиенте
Процедура ОК(Команда)
    Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
    Закрыть();
КонецПроцедуры
