////////////////////////////////////////////////////////////////////////////////
// Подсистема "Свойства"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет наборы свойств объекта. Обычно требуется, если наборов более одного.
//
// Параметры:
//  Объект       - Ссылка на владельца свойств.
//                 Объект владельца свойств.
//                 ДанныеФормыСтруктура (по типу объекта владельца свойств).
//
//  ТипСсылки    - Тип - тип ссылки владельца свойств.
//
//  НаборыСвойств - ТаблицаЗначений с колонками:
//                    Набор - СправочникСсылка.НаборыДополнительныхРеквизитовИСведений.
//
//                    // Далее свойства элемента формы типа ГруппаФормы вида обычная группа
//                    // или страница, которая создается, если наборов больше одного без учета
//                    // пустого набора, который описывает свойства группы удаленных реквизитов.
//                    
//                    // Если значение Неопределено, значит использовать значение по умолчанию.
//                    
//                    // Для любой группы управляемой формы.
//                    Высота                   - Число.
//                    Заголовок                - Строка.
//                    Подсказка                - Строка.
//                    РастягиватьПоВертикали   - Булево.
//                    РастягиватьПоГоризонтали - Булево.
//                    ТолькоПросмотр           - Булево.
//                    ЦветТекстаЗаголовка      - Цвет.
//                    Ширина                   - Число.
//                    ШрифтЗаголовка           - Шрифт.
//                    
//                    // Для обычной группы и страницы.
//                    Группировка              - ГруппировкаПодчиненныхЭлементовФормы.
//                    
//                    // Для обычной группы.
//                    Отображение                - ОтображениеОбычнойГруппы.
//                    ШиринаПодчиненныхЭлементов - ШиринаПодчиненныхЭлементовФормы.
//                    
//                    // Для страницы.
//                    Картинка                 - Картинка.
//                    ОтображатьЗаголовок      - Булево.
//
//  СтандартнаяОбработка - Булево - начальное значение Истина. Указывает получать ли
//                         основной набор, когда НаборыСвойств.Количество() равно нулю.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка) Экспорт
	
	 Если ТипСсылки = Тип("СправочникСсылка.Контрагенты") Тогда
        ЗаполнитьНаборыСвойствКонтрагента(Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли;
	
	 Если ТипСсылки = Тип("СправочникСсылка.Организации") Тогда
        ЗаполнитьНаборыСвойствОрганизации(Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли;
	
	Если ТипСсылки = Тип("ДокументСсылка.ТаможняРассчёты") Тогда
		ЗаполнитьНаборыСвойствТаможняРассчёты(Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли;
	
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции БСП.
// 
// Теперь вместо указания имени реквизита, содержащего вид владельца свойств,
// например, ВидНоменклатуры типа СправочникСсылка.ВидыНоменклатуры,
// у которого должен быть реквизит НаборСвойств типа
// СправочникСсылка.НаборыДополнительныхРеквизитовИСведений
// следует заполнить набор свойств для объекта СправочникСсылка.Номенклатура
// в процедуре ЗаполнитьНаборыСвойствОбъекта, как и в случае нескольких
// наборов свойств. Отличие лишь в том, что набор будет получен из реквизита
// объекта вида владельца самостоятельно, что позволяет использовать несколько
// разных реквизитов с удобными именами для разных типов объектов у которых
// один вид объектов. Например, Справочник.Проекты это вид владельца свойств
// у Справочник.Ошибки и Справочник.Задачи, для которых в справочнике Проекты
// будут реквизиты НаборСвойствОшибок, НаборСвойствЗадач.
//
Функция ПолучитьИмяРеквизитаВидаОбъекта(Ссылка) Экспорт
	
	Возврат "";
	
КонецФункции




//////////////////////////////////////ПРОЦЕДУРЫ, ДОБАВЛЕННЫЕ ЛОБОВЫМ ДМ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьНаборыСвойствКонтрагента(Контрагент, ТипСсылки, НаборыСвойств)
	
	Если ТипЗнч(Контрагент) = ТипСсылки Тогда
		Контрагент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Контрагент, "ВалютныйРассчёт, ЭтоГруппа");
	КонецЕсли;
	
	Если Контрагент.ЭтоГруппа = Ложь Тогда
		
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты_Общие;
		Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
		Строка.ОтображатьЗаголовок = Истина;
		Строка.Заголовок = НСтр("ru = 'Для всех контрагентов'");
		
		Если Контрагент.ВалютныйРассчёт Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты_ВалютныйРассчёт;
			Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
			Строка.Заголовок = НСтр("ru = 'Для иностранных контрагентов'");
			Строка.ОтображатьЗаголовок = Истина;
		КонецЕсли;
		
		// Свойства группы удаленных реквизитов.
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
		Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
		Строка.ОтображатьЗаголовок = Истина;
		Строка.Заголовок = НСтр("ru = 'Более не используемые реквизиты'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаборыСвойствОрганизации(Организация, ТипСсылки, НаборыСвойств)
	
	Если ТипЗнч(Организация) = ТипСсылки Тогда
		Организация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Организация, "Родитель, ЭтоГруппа");
	КонецЕсли;
	
	Если Организация.ЭтоГруппа = Ложь Тогда
		
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Организации_Общие;
		Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
		Строка.ОтображатьЗаголовок = Истина;
		Строка.Заголовок = НСтр("ru = 'Для всех организаций'");
		
		Если Организация.Родитель = Справочники.Организации.Таможни Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Организации_Таможни;
			Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
			Строка.Заголовок = НСтр("ru = 'Для таможенных организаций'");
			Строка.ОтображатьЗаголовок = Истина;
		КонецЕсли;
		
		// Свойства группы удаленных реквизитов.
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
		Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
		Строка.ОтображатьЗаголовок = Истина;
		Строка.Заголовок = НСтр("ru = 'Более не используемые реквизиты'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаборыСвойствТаможняРассчёты(ТаможняРассчёты, ТипСсылки, НаборыСвойств)

	Если ТипЗнч(ТаможняРассчёты) = ТипСсылки Тогда
		ТаможняРассчёты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ТаможняРассчёты, "Контрагент");
	КонецЕсли;
	
	//Общие наборы свойств
	Строка = НаборыСвойств.Добавить();
	Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ТаможняРассчёты_Общие;
	Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
	Строка.ОтображатьЗаголовок = Истина;
	Строка.Заголовок = НСтр("ru = 'Для всех переводов'");
	
	//Дополнительные наборы свойств
	Если ТаможняРассчёты.Контрагент.ВалютныйРассчёт Тогда
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ТаможняРассчёты_ВалютныеПереводы;
		Строка.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыЛиния();
		Строка.Заголовок = НСтр("ru = 'Для валютных переводов'");
		Строка.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

